# DetailCurveArray Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DetailCurveArray Class
Members See Also
---
An array that can contain any type of object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DetailCurveArray : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class DetailCurveArray _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class DetailCurveArray : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..DetailCurveArray
# See Also
DetailCurveArray Members
Autodesk.Revit.DB Namespace